app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2023-08-11 16:26:01.588101"], ["updated_at", "2023-08-11 16:26:01.588101"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at", "quantity", "order_id", "price") VALUES (?, ?, ?, ?, ?, ?, ?)  [["product_id", 207281424], ["cart_id", 980190963], ["created_at", "2023-08-28 19:24:48.367401"], ["updated_at", "2023-08-28 19:24:48.367401"], ["quantity", 1], ["order_id", nil], ["price", 49.5]]
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product)
    session[:counter] = 0

    respond_to do |format|
      if @line_item.save

DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 980190962]]
---
  def update
    respond_to do |format|
      if @line_item.quantity > 1
        if @line_item.update('quantity' => @line_item.quantity - 1)
          format.turbo_stream { @current_item = @line_item }
          format.html { redirect_to store_index_url }
          format.json { render :show, status: :ok, location: @line_item }
        else
          format.html { render :edit, status: :unprocessable_entity }
          format.json { render json: @line_item.errors, status: :unprocessable_entity }
        end
      else
        @line_item.destroy