app/controllers/products_controller.rb

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "title" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["title", "The Great Book 698"], ["updated_at", "2023-08-10 18:58:23.088724"], ["id", 980190962]]