app/controllers/store_controller.rb

SELECT "products".* FROM "products" ORDER BY "products"."title" ASC
---
  def index
    if session[:counter]
      session[:counter] += 1
    else
      session[:counter] = 0
    end
    @products = Product.order(:title)