app/views/layouts/_cart.html.erb

<% if @cart and not @cart.line_items.empty? %>
---
SELECT 1 AS one FROM "line_items" WHERE "line_items"."cart_id" = ? LIMIT ?  [["cart_id", 980190963], ["LIMIT", 1]]